examples.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-18 Fri 16:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Examples</title>
<meta name="author" content="TREX-CoE" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" title="Standard" href="trexio.css" type="text/css" />



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Examples</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org43c3705">1. Writing nuclear coordinates</a>
<ul>
<li><a href="#org2d52e62">1.1. C</a></li>
<li><a href="#org0d51f1b">1.2. Python</a></li>
<li><a href="#org9355325">1.3. Fortran</a></li>
</ul>
</li>
<li><a href="#org485fb40">2. Accessing sparse quantities (integrals)</a>
<ul>
<li><a href="#org9325904">2.1. Fortran</a>
<ul>
<li><a href="#org81d98d8">2.1.1. Declare Temporary variables</a></li>
<li><a href="#orga578a9b">2.1.2. Obtain the name of the TREXIO file from the command line, and open it for reading</a></li>
<li><a href="#org241bfec">2.1.3. Read the nuclear repulsion energy</a></li>
<li><a href="#orgea38f96">2.1.4. Read the number of molecular orbitals</a></li>
<li><a href="#orga42f5ea">2.1.5. Allocate memory</a></li>
<li><a href="#org2a32b09">2.1.6. Read one-electron quantities</a></li>
<li><a href="#org73e5848">2.1.7. Read two-electron quantities</a>
<ul>
<li><a href="#org6e4348d">2.1.7.1. Electron repulsion integrals</a></li>
<li><a href="#org35cfae5">2.1.7.2. Reduced density matrix</a></li>
</ul>
</li>
<li><a href="#orgfecc9fd">2.1.8. Compute the energy</a></li>
<li><a href="#org42cbcf3">2.1.9. Terminate</a></li>
</ul>
</li>
<li><a href="#orge0e7bae">2.2. Python</a>
<ul>
<li><a href="#org0de5da4">2.2.1. Obtain the name of the TREXIO file from the command line, and open it for reading</a></li>
<li><a href="#org1c5d83f">2.2.2. Read the nuclear repulsion energy</a></li>
<li><a href="#org1c9c95f">2.2.3. Read the number of molecular orbitals</a></li>
<li><a href="#orgcd1fddf">2.2.4. Read one-electron quantities</a></li>
<li><a href="#org5a8364c">2.2.5. Read two-electron quantities</a>
<ul>
<li><a href="#orgb304cde">2.2.5.1. Electron repulsion integrals</a></li>
<li><a href="#org570ab49">2.2.5.2. Reduced density matrix</a></li>
</ul>
</li>
<li><a href="#org097c306">2.2.6. Compute the energy</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org854f05f">3. Reading determinants</a>
<ul>
<li><a href="#org26bb205">3.1. Fortran</a></li>
</ul>
</li>
<li><a href="#org4fb8efd">4. Reordering basis functions</a>
<ul>
<li><a href="#org6ce2d48">4.1. Cartesian AOs</a></li>
<li><a href="#orgf6bf9f8">4.2. Spherical AOs</a></li>
<li><a href="#org9c5c919">4.3. Reordering the MOs</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org43c3705" class="outline-2">
<h2 id="org43c3705"><span class="section-number-2">1.</span> Writing nuclear coordinates</h2>
<div class="outline-text-2" id="text-1">
<p>
This example demonstrates how to write the nuclear coordinates of a
water molecule to a file using TREXIO. It covers the basic steps
involved in opening a file, writing data, and closing it, as well as
the necessary TREXIO functions to perform these actions.
</p>
</div>

<div id="outline-container-org2d52e62" class="outline-3">
<h3 id="org2d52e62"><span class="section-number-3">1.1.</span> C</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;trexio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">num</span> = 3;  // <span style="color: #b22222;">Number of atoms
</span>  <span style="color: #228b22;">double</span> <span style="color: #a0522d;">coord</span>[][3] = {
    // <span style="color: #b22222;">xyz coordinates in atomic units
</span>    0.  ,  0.        , -0.24962655,
    0.  ,  2.70519714,  1.85136466,
    0.  , -2.70519714,  1.85136466 };

  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc</span>;

  // <span style="color: #b22222;">Open the TREXIO file
</span>  <span style="color: #228b22;">trexio_t</span>* <span style="color: #a0522d;">f</span> = trexio_open(<span style="color: #8b2252;">"water.trexio"</span>, <span style="color: #8b2252;">'w'</span>, TREXIO_HDF5, &amp;rc);
  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) {
    fprintf(stderr, <span style="color: #8b2252;">"Error: %s\n"</span>, trexio_string_of_error(rc));
    <span style="color: #a020f0;">return</span> -1;
  }

  // <span style="color: #b22222;">Write the number of nuclei
</span>  rc = trexio_write_nucleus_num (f, num);
  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) {
    fprintf(stderr, <span style="color: #8b2252;">"Error: %s\n"</span>, trexio_string_of_error(rc));
    <span style="color: #a020f0;">return</span> -1;
  }

  // <span style="color: #b22222;">Write the nuclear coordinates
</span>  rc = trexio_write_nucleus_coord (f, &amp;coord[0][0]);
  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) {
    fprintf(stderr, <span style="color: #8b2252;">"Error: %s\n"</span>, trexio_string_of_error(rc));
    <span style="color: #a020f0;">return</span> -1;
  }

  // <span style="color: #b22222;">Close the TREXIO file
</span>  rc = trexio_close(f);
  <span style="color: #a020f0;">if</span> (rc != TREXIO_SUCCESS) {
    fprintf(stderr, <span style="color: #8b2252;">"Error: %s\n"</span>, trexio_string_of_error(rc));
    <span style="color: #a020f0;">return</span> -1;
  }
  <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org0d51f1b" class="outline-3">
<h3 id="org0d51f1b"><span class="section-number-3">1.2.</span> Python</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This code uses the TREXIO Python binding to create a new TREXIO file named
<code>water.trexio</code>, and write the nuclear coordinates of a water molecule.
</p>

<p>
The <code>coord</code> variable is a list of three lists, each containing the x, y,
and z coordinates of the water molecule's nuclei.
</p>

<p>
The <code>with</code> statement is used to ensure the file is properly closed after
the write is complete.
</p>

<p>
The <code>trexio.write_nucleus_num</code> function is used to write the number of
nuclei in the system.
</p>

<p>
The <code>trexio.write_nucleus_coord</code> function is used to write the nuclear
coordinates of the system.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> trexio
<span style="color: #a0522d;">coord</span> = [    # <span style="color: #b22222;">xyz coordinates in atomic units
</span>    [0. , 0., -0.24962655],
    [0. , 2.70519714, 1.85136466],
    [0. , -2.70519714, 1.85136466]
]
# <span style="color: #b22222;">The Python API calls can raise `trexio.Error`
</span># <span style="color: #b22222;">exceptions to be handled via try/except clauses
</span># <span style="color: #b22222;">in the user application
</span><span style="color: #a020f0;">with</span> trexio.File(<span style="color: #8b2252;">"water.trexio"</span>, <span style="color: #8b2252;">'w'</span>,
                 back_end=trexio.TREXIO_HDF5) <span style="color: #a020f0;">as</span> f:
    trexio.write_nucleus_num(f, <span style="color: #483d8b;">len</span>(coord))
    trexio.write_nucleus_coord(f, coord)

</pre>
</div>
</div>
</div>
