examples.html

<div id="outline-container-org9355325" class="outline-3">
<h3 id="org9355325"><span class="section-number-3">1.3.</span> Fortran</h3>
<div class="outline-text-3" id="text-1-3">
<p>
In Fortran, you will need to use the <code>trexio</code> module.
Due to potential issues with compiler versions and <code>.mod</code> files, it is
recommended to include the source version of this module directly in
your source code.
The corresponding file is installed in a standard location when the
library is installed using <code>make install</code>, in the <code>include</code>
directory.
</p>

<p>
To avoid duplicating this file every time you update the TREXIO library,
create a file named <code>trexio_module.F90</code> (note the capital F in the
suffix) containing:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;trexio_f.f90&gt;</span>
</pre>
</div>

<p>
Compile this new file and add the <code>trexio_module.o</code> file at link
time.
</p>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">program</span> <span style="color: #0000ff;">trexio_water</span>
  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">trexio</span>

  <span style="color: #228b22;">integer</span>, <span style="color: #a020f0;">parameter</span>        ::<span style="color: #a0522d;"> num=3       </span>! <span style="color: #b22222;">Number of nuclei
</span>  <span style="color: #228b22;">double precision</span>          ::<span style="color: #a0522d;"> coord(3,3)  </span>! <span style="color: #b22222;">Array of atom coordinates
</span>
  <span style="color: #228b22;">integer</span>(trexio_t)         ::<span style="color: #a0522d;"> f        </span>! <span style="color: #b22222;">The TREXIO file handle
</span>  <span style="color: #228b22;">integer</span>(trexio_exit_code) ::<span style="color: #a0522d;"> rc       </span>! <span style="color: #b22222;">TREXIO return code
</span>  <span style="color: #228b22;">character</span>*(128)           ::<span style="color: #a0522d;"> err_msg  </span>! <span style="color: #b22222;">String holding the error message
</span>
  coord(:,:) = <span style="color: #a020f0;">reshape</span>( (/ 0.d0  ,  0.d0        , -0.24962655d0, <span style="color: #a020f0;">&amp;</span>
                           0.d0  ,  2.70519714d0,  1.85136466d0, <span style="color: #a020f0;">&amp;</span>
                           0.d0  , -2.70519714d0,  1.85136466d0  /), <span style="color: #a020f0;">&amp;</span>
                         <span style="color: #a020f0;">shape</span>(coord) )

  ! <span style="color: #b22222;">Open the TREXIO file
</span>  f = trexio_open (<span style="color: #8b2252;">'water.trexio'</span>, <span style="color: #8b2252;">'w'</span>, TREXIO_HDF5, rc)
  <span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
     <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">trexio_string_of_error</span>(rc, err_msg)
     <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Error: '</span>//<span style="color: #a020f0;">trim</span>(err_msg)
     <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">exit</span>(-1)
  <span style="color: #a020f0;">end if</span>

  ! <span style="color: #b22222;">Write the number of nuclei
</span>  rc = trexio_write_nucleus_num (f, num)
  <span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
     <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">trexio_string_of_error</span>(rc, err_msg)
     <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Error: '</span>//<span style="color: #a020f0;">trim</span>(err_msg)
     <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">exit</span>(-1)
  <span style="color: #a020f0;">end if</span>

  ! <span style="color: #b22222;">Write the nuclear coordinates
</span>  rc = trexio_write_nucleus_coord (f, coord)
  <span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
     <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">trexio_string_of_error</span>(rc, err_msg)
     <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Error: '</span>//<span style="color: #a020f0;">trim</span>(err_msg)
     <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">exit</span>(-1)
  <span style="color: #a020f0;">end if</span>

  ! <span style="color: #b22222;">Close the TREXIO file
</span>  rc = trexio_close(f)
  <span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
     <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">trexio_string_of_error</span>(rc, err_msg)
     <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Error: '</span>//<span style="color: #a020f0;">trim</span>(err_msg)
     <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">exit</span>(-1)
  <span style="color: #a020f0;">end if</span>

<span style="color: #a020f0;">end program</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org485fb40" class="outline-2">
<h2 id="org485fb40"><span class="section-number-2">2.</span> Accessing sparse quantities (integrals)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9325904" class="outline-3">
<h3 id="org9325904"><span class="section-number-3">2.1.</span> Fortran</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">program</span> <span style="color: #0000ff;">print_energy</span>
  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">trexio</span>
  <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>

  <span style="color: #228b22;">character</span>*(128)  ::<span style="color: #a0522d;"> filename   </span>! <span style="color: #b22222;">Name of the input file
</span>  <span style="color: #228b22;">integer</span>          ::<span style="color: #a0522d;"> rc         </span>! <span style="color: #b22222;">Return code for error checking
</span>  <span style="color: #228b22;">integer</span>(8)       ::<span style="color: #a0522d;"> f          </span>! <span style="color: #b22222;">TREXIO file handle
</span>  <span style="color: #228b22;">character</span>*(128)  ::<span style="color: #a0522d;"> err_msg    </span>! <span style="color: #b22222;">Error message</span>
</pre>
</div>

<p>
This program computes the energy as:
</p>

<p>
\[
   E = E_{\text{NN}} + \sum_{ij} \gamma_{ij}\, \langle j | h | i \rangle\,
   +\, \frac{1}{2} \sum_{ijkl} \Gamma_{ijkl}\, \langle k l | i j
   \rangle\; \textrm{ with } \; 0 < i,j,k,l \le n
   \]
One needs to read from the TREXIO file:
</p>

<dl class="org-dl">
<dt>\(n\)</dt><dd>The number of molecular orbitals</dd>
<dt>\(E_{\text{NN}}\)</dt><dd>The nuclear repulsion energy</dd>
<dt>\(\gamma_{ij}\)</dt><dd>The one-body reduced density matrix</dd>
<dt>\(\langle j |h| i \rangle\)</dt><dd>The one-electron Hamiltonian integrals</dd>
<dt>\(\Gamma_{ijkl}\)</dt><dd>The two-body reduced density matrix</dd>
<dt>\(\langle k l  | i j \rangle\)</dt><dd>The electron repulsion integrals</dd>
</dl>


<div class="org-src-container">
<pre class="src src-f90"><span style="color: #228b22;">integer</span>                       ::<span style="color: #a0522d;"> n</span>
<span style="color: #228b22;">double precision</span>              ::<span style="color: #a0522d;"> E, E_nn</span>
<span style="color: #228b22;">double precision</span>, <span style="color: #a020f0;">allocatable</span> ::<span style="color: #a0522d;"> D(:,:), h0(:,:)</span>
<span style="color: #228b22;">double precision</span>, <span style="color: #a020f0;">allocatable</span> ::<span style="color: #a0522d;"> G(:,:,:,:), W(:,:,:,:)</span>
</pre>
</div>
</div>

<div id="outline-container-org81d98d8" class="outline-4">
<h4 id="org81d98d8"><span class="section-number-4">2.1.1.</span> Declare Temporary variables</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-f90"><span style="color: #228b22;">integer</span>                       ::<span style="color: #a0522d;"> i, j, k, l, m</span>
<span style="color: #228b22;">integer</span>(8), <span style="color: #a020f0;">parameter</span>         ::<span style="color: #a0522d;"> BUFSIZE = 100000_8</span>
<span style="color: #228b22;">integer</span>(8)                    ::<span style="color: #a0522d;"> offset, icount, size_max</span>
<span style="color: #228b22;">integer</span>                       ::<span style="color: #a0522d;"> buffer_index(4,BUFSIZE)</span>
<span style="color: #228b22;">double precision</span>              ::<span style="color: #a0522d;"> buffer_values(BUFSIZE)</span>

<span style="color: #228b22;">double precision</span>, <span style="color: #a020f0;">external</span>    ::<span style="color: #a0522d;"> ddot   </span>! <span style="color: #b22222;">BLAS dot product</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga578a9b" class="outline-4">
<h4 id="orga578a9b"><span class="section-number-4">2.1.2.</span> Obtain the name of the TREXIO file from the command line, and open it for reading</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">call</span> <span style="color: #0000ff;">getarg</span>(1, filename)

f = trexio_open (filename, <span style="color: #8b2252;">'r'</span>, TREXIO_AUTO, rc)
<span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
   <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">trexio_string_of_error</span>(rc, err_msg)
   <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Error opening TREXIO file: '</span>//<span style="color: #a020f0;">trim</span>(err_msg)
   <span style="color: #a020f0;">stop</span>
<span style="color: #a020f0;">end if</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org241bfec" class="outline-4">
<h4 id="org241bfec"><span class="section-number-4">2.1.3.</span> Read the nuclear repulsion energy</h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">
<pre class="src src-f90">rc = trexio_read_nucleus_repulsion(f, E_nn)
<span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
   <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">trexio_string_of_error</span>(rc, err_msg)
   <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Error reading nuclear repulsion: '</span>//<span style="color: #a020f0;">trim</span>(err_msg)
   <span style="color: #a020f0;">stop</span>
<span style="color: #a020f0;">end if</span>
</pre>
</div>
</div>
</div>
