examples.html

<div id="outline-container-orgea38f96" class="outline-4">
<h4 id="orgea38f96"><span class="section-number-4">2.1.4.</span> Read the number of molecular orbitals</h4>
<div class="outline-text-4" id="text-2-1-4">
<div class="org-src-container">
<pre class="src src-f90">rc = trexio_read_mo_num(f, n)
<span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
   <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">trexio_string_of_error</span>(rc, err_msg)
   <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Error reading number of MOs: '</span>//<span style="color: #a020f0;">trim</span>(err_msg)
   <span style="color: #a020f0;">stop</span>
<span style="color: #a020f0;">end if</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga42f5ea" class="outline-4">
<h4 id="orga42f5ea"><span class="section-number-4">2.1.5.</span> Allocate memory</h4>
<div class="outline-text-4" id="text-2-1-5">
<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">allocate</span>( D(n,n), h0(n,n) )
<span style="color: #a020f0;">allocate</span>( G(n,n,n,n), W(n,n,n,n) )
G(:,:,:,:) = 0.d0
W(:,:,:,:) = 0.d0
</pre>
</div>
</div>
</div>

<div id="outline-container-org2a32b09" class="outline-4">
<h4 id="org2a32b09"><span class="section-number-4">2.1.6.</span> Read one-electron quantities</h4>
<div class="outline-text-4" id="text-2-1-6">
<div class="org-src-container">
<pre class="src src-f90">rc = trexio_has_mo_1e_int_core_hamiltonian(f)
<span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
   <span style="color: #a020f0;">stop</span> <span style="color: #8b2252;">'No core hamiltonian in file'</span>
<span style="color: #a020f0;">end if</span>

rc = trexio_read_mo_1e_int_core_hamiltonian(f, h0)
<span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
   <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">trexio_string_of_error</span>(rc, err_msg)
   <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Error reading core Hamiltonian: '</span>//<span style="color: #a020f0;">trim</span>(err_msg)
   <span style="color: #a020f0;">stop</span>
<span style="color: #a020f0;">end if</span>


rc = trexio_has_rdm_1e(f)
<span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
   <span style="color: #a020f0;">stop</span> <span style="color: #8b2252;">'No 1e RDM in file'</span>
<span style="color: #a020f0;">end if</span>

rc = trexio_read_rdm_1e(f, D)
<span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
   <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">trexio_string_of_error</span>(rc, err_msg)
   <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Error reading one-body RDM: '</span>//<span style="color: #a020f0;">trim</span>(err_msg)
   <span style="color: #a020f0;">stop</span>
<span style="color: #a020f0;">end if</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org73e5848" class="outline-4">
<h4 id="org73e5848"><span class="section-number-4">2.1.7.</span> Read two-electron quantities</h4>
<div class="outline-text-4" id="text-2-1-7">
<p>
Reading is done with OpenMP. Each thread reads its own buffer, and
the buffers are then processed in parallel.
</p>

<p>
Reading the file requires a lock, so it is done in a critical
section. The <code>offset</code> variable is shared, and it is incremented in
the critical section. For each read, the function returns in
<code>icount</code> the number of read integrals, so this variable needs also
to be protected in the critical section when modified.
</p>
</div>

<div id="outline-container-org6e4348d" class="outline-5">
<h5 id="org6e4348d"><span class="section-number-5">2.1.7.1.</span> Electron repulsion integrals</h5>
<div class="outline-text-5" id="text-2-1-7-1">
<div class="org-src-container">
<pre class="src src-f90">rc = trexio_has_mo_2e_int_eri(f)
<span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
   <span style="color: #a020f0;">stop</span> <span style="color: #8b2252;">'No electron repulsion integrals in file'</span>
<span style="color: #a020f0;">end if</span>

rc = trexio_read_mo_2e_int_eri_size (f, size_max)
<span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
   <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">trexio_string_of_error</span>(rc, err_msg)
   <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Error reading number of ERIs: '</span>//<span style="color: #a020f0;">trim</span>(err_msg)
   <span style="color: #a020f0;">stop</span>
<span style="color: #a020f0;">end if</span>

offset = 0_8
!<span style="color: #b22222;">$OMP PARALLEL DEFAULT(SHARED) PRIVATE(icount, i, j, k, l, &amp;
</span>!<span style="color: #b22222;">$OMP   buffer_index, buffer_values, m)
</span>icount = BUFSIZE
<span style="color: #a020f0;">do while</span> (icount == BUFSIZE)
  !<span style="color: #b22222;">$OMP CRITICAL
</span>  <span style="color: #a020f0;">if</span> (offset &lt; size_max) <span style="color: #a020f0;">then</span>
    rc = trexio_read_mo_2e_int_eri(f, offset, icount, buffer_index, buffer_values)
    offset = offset + icount
  <span style="color: #a020f0;">else</span>
    icount = 0
  <span style="color: #a020f0;">end if</span>
  !<span style="color: #b22222;">$OMP END CRITICAL
</span>  <span style="color: #a020f0;">do</span> m=1,icount
    i = buffer_index(1,m)
    j = buffer_index(2,m)
    k = buffer_index(3,m)
    l = buffer_index(4,m)
    W(i,j,k,l) = buffer_values(m)
    W(k,j,i,l) = buffer_values(m)
    W(i,l,k,j) = buffer_values(m)
    W(k,l,i,j) = buffer_values(m)
    W(j,i,l,k) = buffer_values(m)
    W(j,k,l,i) = buffer_values(m)
    W(l,i,j,k) = buffer_values(m)
    W(l,k,j,i) = buffer_values(m)
  <span style="color: #a020f0;">end do</span>
<span style="color: #a020f0;">end do</span>
!<span style="color: #b22222;">$OMP END PARALLEL</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org35cfae5" class="outline-5">
<h5 id="org35cfae5"><span class="section-number-5">2.1.7.2.</span> Reduced density matrix</h5>
<div class="outline-text-5" id="text-2-1-7-2">
<div class="org-src-container">
<pre class="src src-f90">rc = trexio_has_rdm_2e(f)
<span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
   <span style="color: #a020f0;">stop</span> <span style="color: #8b2252;">'No two-body density matrix in file'</span>
<span style="color: #a020f0;">end if</span>

rc = trexio_read_rdm_2e_size (f, size_max)
<span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
   <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">trexio_string_of_error</span>(rc, err_msg)
   <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Error reading number of 2-RDM elements: '</span>//<span style="color: #a020f0;">trim</span>(err_msg)
   <span style="color: #a020f0;">stop</span>
<span style="color: #a020f0;">end if</span>

offset = 0_8
!<span style="color: #b22222;">$OMP PARALLEL DEFAULT(SHARED) PRIVATE(icount, i, j, k, l, &amp;
</span>!<span style="color: #b22222;">$OMP   buffer_index, buffer_values, m)
</span>icount = bufsize
<span style="color: #a020f0;">do while</span> (offset &lt; size_max)
  !<span style="color: #b22222;">$OMP CRITICAL
</span>  <span style="color: #a020f0;">if</span> (offset &lt; size_max) <span style="color: #a020f0;">then</span>
    rc = trexio_read_rdm_2e(f, offset, icount, buffer_index, buffer_values)
    offset = offset + icount
  <span style="color: #a020f0;">else</span>
    icount = 0
  <span style="color: #a020f0;">end if</span>
  !<span style="color: #b22222;">$OMP END CRITICAL
</span>  <span style="color: #a020f0;">do</span> m=1,icount
    i = buffer_index(1,m)
    j = buffer_index(2,m)
    k = buffer_index(3,m)
    l = buffer_index(4,m)
    G(i,j,k,l) = buffer_values(m)
  <span style="color: #a020f0;">end do</span>
<span style="color: #a020f0;">end do</span>
!<span style="color: #b22222;">$OMP END PARALLEL
</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfecc9fd" class="outline-4">
<h4 id="orgfecc9fd"><span class="section-number-4">2.1.8.</span> Compute the energy</h4>
<div class="outline-text-4" id="text-2-1-8">
<p>
When the orbitals are real, we can use
</p>
\begin{eqnarray*}
E &=& E_{\text{NN}} + \sum_{ij} \gamma_{ij}\, \langle j | h | i \rangle\,
+\, \frac{1}{2} \sum_{ijkl} \Gamma_{ijkl}\, \langle k l | i j
\rangle \\
  &=& E_{\text{NN}} + \sum_{ij} \gamma_{ij}\, \langle i | h | j \rangle\,
+\, \frac{1}{2} \sum_{ijkl} \Gamma_{ijkl}\, \langle i j | k l
\rangle \\
\end{eqnarray*}

<p>
As \((n,m)\) 2D arrays are stored in memory as \((n \times m)\) 1D
arrays, we could pass the matrices to the <code>ddot</code> BLAS function to
perform the summations in a single call for the 1-electron quantities.
Instead, we prefer to interleave the 1-electron (negative) and
2-electron (positive) summations to have a better cancellation of
numerical errors.
</p>

<p>
Here \(n^4\) can be larger than the largest possible 32-bit integer,
so it is not safe to pass \(n^4\) to the <code>ddot</code> BLAS
function. Hence, we perform \(n^2\) loops, using vectors of size \(n^2\).
</p>

<div class="org-src-container">
<pre class="src src-f90">
E = 0.d0
<span style="color: #a020f0;">do</span> l=1,n
  E = E + ddot( n, D(1,l), 1, h0(1,l), 1 ) 
  <span style="color: #a020f0;">do</span> k=1,n
     E = E + 0.5d0 * ddot( n*n, G(1,1,k,l), 1, W(1,1,k,l),  1 )
  <span style="color: #a020f0;">end do</span>
<span style="color: #a020f0;">end do</span>
E = E + E_nn

<span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Energy: '</span>, E
</pre>
</div>
</div>
</div>

<div id="outline-container-org42cbcf3" class="outline-4">
<h4 id="org42cbcf3"><span class="section-number-4">2.1.9.</span> Terminate</h4>
<div class="outline-text-4" id="text-2-1-9">
<div class="org-src-container">
<pre class="src src-f90">  <span style="color: #a020f0;">deallocate</span>( D, h0, G, W )

<span style="color: #a020f0;">end program</span>
</pre>
</div>
</div>
</div>
</div>
