examples.html

<div id="outline-container-orge0e7bae" class="outline-3">
<h3 id="orge0e7bae"><span class="section-number-3">2.2.</span> Python</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> sys
<span style="color: #a020f0;">import</span> trexio
<span style="color: #a020f0;">import</span> numpy <span style="color: #a020f0;">as</span> np

<span style="color: #a0522d;">BUFSIZE</span> = 100000
</pre>
</div>

<p>
This program computes the energy as:
</p>

<p>
\[
   E = E_{\text{NN}} + \sum_{ij} \gamma_{ij}\, \langle j | h | i \rangle\,
   +\, \frac{1}{2} \sum_{ijkl} \Gamma_{ijkl}\, \langle k l | i j
   \rangle\; \textrm{ with } \; 0 < i,j,k,l \le n
   \]
One needs to read from the TREXIO file:
</p>

<dl class="org-dl">
<dt>\(n\)</dt><dd>The number of molecular orbitals</dd>
<dt>\(E_{\text{NN}}\)</dt><dd>The nuclear repulsion energy</dd>
<dt>\(\gamma_{ij}\)</dt><dd>The one-body reduced density matrix</dd>
<dt>\(\langle j |h| i \rangle\)</dt><dd>The one-electron Hamiltonian integrals</dd>
<dt>\(\Gamma_{ijkl}\)</dt><dd>The two-body reduced density matrix</dd>
<dt>\(\langle k l  | i j \rangle\)</dt><dd>The electron repulsion integrals</dd>
</dl>
</div>

<div id="outline-container-org0de5da4" class="outline-4">
<h4 id="org0de5da4"><span class="section-number-4">2.2.1.</span> Obtain the name of the TREXIO file from the command line, and open it for reading</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">filename</span> = sys.argv[1]
<span style="color: #a0522d;">f</span> = trexio.File(filename, <span style="color: #8b2252;">'r'</span>, trexio.TREXIO_AUTO)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c5d83f" class="outline-4">
<h4 id="org1c5d83f"><span class="section-number-4">2.2.2.</span> Read the nuclear repulsion energy</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">E_nn</span> = trexio.read_nucleus_repulsion(f)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c9c95f" class="outline-4">
<h4 id="org1c9c95f"><span class="section-number-4">2.2.3.</span> Read the number of molecular orbitals</h4>
<div class="outline-text-4" id="text-2-2-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">n</span> = trexio.read_mo_num(f)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd1fddf" class="outline-4">
<h4 id="orgcd1fddf"><span class="section-number-4">2.2.4.</span> Read one-electron quantities</h4>
<div class="outline-text-4" id="text-2-2-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">if</span> <span style="color: #a020f0;">not</span> trexio.has_mo_1e_int_core_hamiltonian(f):
  <span style="color: #483d8b;">print</span>(<span style="color: #8b2252;">"No core hamiltonian in file"</span>)
  sys.<span style="color: #008b8b;">exit</span>(-1)

<span style="color: #a0522d;">h0</span> = trexio.read_mo_1e_int_core_hamiltonian(f)

<span style="color: #a020f0;">if</span> <span style="color: #a020f0;">not</span> trexio.has_rdm_1e(f):
  <span style="color: #483d8b;">print</span>(<span style="color: #8b2252;">"No 1e RDM in file"</span>)
  sys.<span style="color: #008b8b;">exit</span>(-1)

<span style="color: #a0522d;">D</span> = trexio.read_rdm_1e(f)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5a8364c" class="outline-4">
<h4 id="org5a8364c"><span class="section-number-4">2.2.5.</span> Read two-electron quantities</h4>
<div class="outline-text-4" id="text-2-2-5">
</div>
<div id="outline-container-orgb304cde" class="outline-5">
<h5 id="orgb304cde"><span class="section-number-5">2.2.5.1.</span> Electron repulsion integrals</h5>
<div class="outline-text-5" id="text-2-2-5-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">if</span> <span style="color: #a020f0;">not</span> trexio.has_mo_2e_int_eri(f):
  <span style="color: #483d8b;">print</span>(<span style="color: #8b2252;">"No electron repulsion integrals in file"</span>)
  sys.<span style="color: #008b8b;">exit</span>(-1)

<span style="color: #a0522d;">size_max</span> = trexio.read_mo_2e_int_eri_size(f)

<span style="color: #a0522d;">offset</span> = 0
<span style="color: #a0522d;">icount</span> = BUFSIZE
<span style="color: #a0522d;">feof</span> = <span style="color: #008b8b;">False</span>
<span style="color: #a0522d;">W</span> = np.zeros( (n,n,n,n) )
<span style="color: #a020f0;">while</span> <span style="color: #a020f0;">not</span> feof:
  <span style="color: #a0522d;">buffer_index</span>, <span style="color: #a0522d;">buffer_values</span>, <span style="color: #a0522d;">icount</span>, <span style="color: #a0522d;">feof</span> = trexio.read_mo_2e_int_eri(f, offset, icount)
  <span style="color: #a0522d;">offset</span> += icount
  <span style="color: #a020f0;">for</span> m <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span>(icount):
    <span style="color: #a0522d;">i</span>, <span style="color: #a0522d;">j</span>, <span style="color: #a0522d;">k</span>, <span style="color: #a0522d;">l</span> = buffer_index[m]
    <span style="color: #a0522d;">W</span>[<span style="color: #a0522d;">i</span>,<span style="color: #a0522d;">j</span>,<span style="color: #a0522d;">k</span>,<span style="color: #a0522d;">l</span>] = buffer_values[m]
    <span style="color: #a0522d;">W</span>[<span style="color: #a0522d;">k</span>,<span style="color: #a0522d;">j</span>,<span style="color: #a0522d;">i</span>,<span style="color: #a0522d;">l</span>] = buffer_values[m]
    <span style="color: #a0522d;">W</span>[<span style="color: #a0522d;">i</span>,<span style="color: #a0522d;">l</span>,<span style="color: #a0522d;">k</span>,<span style="color: #a0522d;">j</span>] = buffer_values[m]
    <span style="color: #a0522d;">W</span>[<span style="color: #a0522d;">k</span>,<span style="color: #a0522d;">l</span>,<span style="color: #a0522d;">i</span>,<span style="color: #a0522d;">j</span>] = buffer_values[m]
    <span style="color: #a0522d;">W</span>[<span style="color: #a0522d;">j</span>,<span style="color: #a0522d;">i</span>,<span style="color: #a0522d;">l</span>,<span style="color: #a0522d;">k</span>] = buffer_values[m]
    <span style="color: #a0522d;">W</span>[<span style="color: #a0522d;">j</span>,<span style="color: #a0522d;">k</span>,<span style="color: #a0522d;">l</span>,<span style="color: #a0522d;">i</span>] = buffer_values[m]
    <span style="color: #a0522d;">W</span>[<span style="color: #a0522d;">l</span>,<span style="color: #a0522d;">i</span>,<span style="color: #a0522d;">j</span>,<span style="color: #a0522d;">k</span>] = buffer_values[m]
    <span style="color: #a0522d;">W</span>[<span style="color: #a0522d;">l</span>,<span style="color: #a0522d;">k</span>,<span style="color: #a0522d;">j</span>,<span style="color: #a0522d;">i</span>] = buffer_values[m]
</pre>
</div>
</div>
</div>

<div id="outline-container-org570ab49" class="outline-5">
<h5 id="org570ab49"><span class="section-number-5">2.2.5.2.</span> Reduced density matrix</h5>
<div class="outline-text-5" id="text-2-2-5-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">if</span> <span style="color: #a020f0;">not</span> trexio.has_rdm_2e(f):
  <span style="color: #483d8b;">print</span>(<span style="color: #8b2252;">"No two-body density matrix in file"</span>)

<span style="color: #a0522d;">offset</span> = 0
<span style="color: #a0522d;">icount</span> = BUFSIZE
<span style="color: #a0522d;">feof</span> = <span style="color: #008b8b;">False</span>
<span style="color: #a0522d;">G</span> = np.zeros( (n,n,n,n) )
<span style="color: #a020f0;">while</span> <span style="color: #a020f0;">not</span> feof:
  <span style="color: #a0522d;">buffer_index</span>, <span style="color: #a0522d;">buffer_values</span>, <span style="color: #a0522d;">icount</span>, <span style="color: #a0522d;">feof</span> = trexio.read_rdm_2e(f, offset, icount)
  <span style="color: #a0522d;">offset</span> += icount
  <span style="color: #a020f0;">for</span> m <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span>(icount):
    <span style="color: #a0522d;">i</span>, <span style="color: #a0522d;">j</span>, <span style="color: #a0522d;">k</span>, <span style="color: #a0522d;">l</span> = buffer_index[m]
    <span style="color: #a0522d;">G</span>[<span style="color: #a0522d;">i</span>,<span style="color: #a0522d;">j</span>,<span style="color: #a0522d;">k</span>,<span style="color: #a0522d;">l</span>] = buffer_values[m]

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org097c306" class="outline-4">
<h4 id="org097c306"><span class="section-number-4">2.2.6.</span> Compute the energy</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
When the orbitals are real, we can use
</p>
\begin{eqnarray*}
E &=& E_{\text{NN}} + \sum_{ij} \gamma_{ij}\, \langle j | h | i \rangle\,
+\, \frac{1}{2} \sum_{ijkl} \Gamma_{ijkl}\, \langle k l | i j
\rangle \\
  &=& E_{\text{NN}} + \sum_{ij} \gamma_{ij}\, \langle i | h | j \rangle\,
+\, \frac{1}{2} \sum_{ijkl} \Gamma_{ijkl}\, \langle i j | k l
\rangle \\
\end{eqnarray*}

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">G</span> = np.reshape(G, (n*n, n*n) )
<span style="color: #a0522d;">W</span> = np.reshape(W, (n*n, n*n) )
<span style="color: #a0522d;">E</span> = E_nn
<span style="color: #a0522d;">E</span> += 0.5*<span style="color: #483d8b;">sum</span>( [ np.dot(G[:,l], W[:,l]) <span style="color: #a020f0;">for</span> l <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span>(n*n) ] )
<span style="color: #a0522d;">E</span> += <span style="color: #483d8b;">sum</span>( [ np.dot(D[:,l], h0[:,l]) <span style="color: #a020f0;">for</span> l <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span>(n) ] )

<span style="color: #483d8b;">print</span> (f<span style="color: #8b2252;">"Energy: </span>{E}<span style="color: #8b2252;">"</span>)
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org854f05f" class="outline-2">
<h2 id="org854f05f"><span class="section-number-2">3.</span> Reading determinants</h2>
<div class="outline-text-2" id="text-3">
</div>
