examples.html
<div id="outline-container-org26bb205" class="outline-3">
<h3 id="org26bb205"><span class="section-number-3">3.1.</span> Fortran</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">program</span> <span style="color: #0000ff;">test</span>

  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">trexio</span>
  <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>

  <span style="color: #228b22;">character</span>*(128)           ::<span style="color: #a0522d;"> filename               </span>! <span style="color: #b22222;">Name of the input file
</span>  <span style="color: #228b22;">integer</span>(trexio_exit_code) ::<span style="color: #a0522d;"> rc                     </span>! <span style="color: #b22222;">Return code for error checking
</span>  <span style="color: #228b22;">integer</span>(trexio_t)         ::<span style="color: #a0522d;"> trex_determinant_file  </span>! <span style="color: #b22222;">TREXIO file handle
</span>  <span style="color: #228b22;">character</span>*(128)           ::<span style="color: #a0522d;"> err_msg                </span>! <span style="color: #b22222;">Error message
</span>

  <span style="color: #228b22;">integer</span>*8, <span style="color: #a020f0;">allocatable</span> ::<span style="color: #a0522d;"> buffer(:,:,:)</span>
  <span style="color: #228b22;">integer</span>(8) ::<span style="color: #a0522d;"> offset, icount, BUFSIZE</span>
  <span style="color: #228b22;">integer</span> ::<span style="color: #a0522d;"> ndet, int64_num, m</span>

  <span style="color: #228b22;">integer</span> ::<span style="color: #a0522d;"> occ_num_up, occ_num_dn</span>
  <span style="color: #228b22;">integer</span>, <span style="color: #a020f0;">allocatable</span> ::<span style="color: #a0522d;"> orb_list_up(:), orb_list_dn(:)</span>

  <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">getarg</span>(1, filename)

  trex_determinant_file = trexio_open(filename, <span style="color: #8b2252;">'r'</span>, TREXIO_AUTO, rc)
  <span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
     <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">trexio_string_of_error</span>(rc, err_msg)
     <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Error opening TREXIO file: '</span>//<span style="color: #a020f0;">trim</span>(err_msg)
     <span style="color: #a020f0;">stop</span>
  <span style="color: #a020f0;">end if</span>

  rc = trexio_read_determinant_num(trex_determinant_file, ndet)
  <span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
     <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">trexio_string_of_error</span>(rc, err_msg)
     <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Error reading determinant_num: '</span>//<span style="color: #a020f0;">trim</span>(err_msg)
     <span style="color: #a020f0;">stop</span>
  <span style="color: #a020f0;">end if</span>
  <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'ndet'</span>, ndet

  rc = trexio_get_int64_num(trex_determinant_file, int64_num)
  <span style="color: #a020f0;">if</span> (rc /= TREXIO_SUCCESS) <span style="color: #a020f0;">then</span>
     <span style="color: #a020f0;">call</span> <span style="color: #0000ff;">trexio_string_of_error</span>(rc, err_msg)
     <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'Error reading int64_num: '</span>//<span style="color: #a020f0;">trim</span>(err_msg)
     <span style="color: #a020f0;">stop</span>
  <span style="color: #a020f0;">end if</span>
  <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'int64_num'</span>, int64_num

  BUFSIZE = 1000_8
  <span style="color: #a020f0;">allocate</span>(buffer(int64_num, 2, BUFSIZE))
  <span style="color: #a020f0;">allocate</span>(orb_list_up(int64_num*64), orb_list_dn(int64_num*64))

  offset = 0_8
  icount = BUFSIZE
  <span style="color: #a020f0;">do while</span> (icount == BUFSIZE)
    <span style="color: #a020f0;">if</span> (offset &lt; ndet) <span style="color: #a020f0;">then</span>
      rc = trexio_read_determinant_list(trex_determinant_file, offset, icount, buffer)
      offset = offset + icount
    <span style="color: #a020f0;">else</span>
      icount = 0
    <span style="color: #a020f0;">end if</span>
    <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">'---'</span>
    <span style="color: #a020f0;">do</span> m=1,icount
      rc = trexio_to_orbital_list_up_dn(int64_num, buffer(1,1,m), <span style="color: #a020f0;">&amp;</span>
           orb_list_up, orb_list_dn, occ_num_up, occ_num_dn)
      <span style="color: #a020f0;">print</span> <span style="color: #8b2252;">'(100(I3,X))'</span>, (orb_list_up(1:occ_num_up)), (orb_list_dn(1:occ_num_dn))
      <span style="color: #a020f0;">print</span> *, <span style="color: #8b2252;">''</span>
    <span style="color: #a020f0;">end do</span>
  <span style="color: #a020f0;">end do</span>

  <span style="color: #a020f0;">deallocate</span>(buffer, orb_list_dn, orb_list_up)

end
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org4fb8efd" class="outline-2">
<h2 id="org4fb8efd"><span class="section-number-2">4.</span> Reordering basis functions</h2>
<div class="outline-text-2" id="text-4">
<p>
Here is a simple recipe to reorder your atomic orbitals in TREXIO
ordering, and to apply this re-ordering to your MOs.
</p>
</div>

<div id="outline-container-org6ce2d48" class="outline-3">
<h3 id="org6ce2d48"><span class="section-number-3">4.1.</span> Cartesian AOs</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li><p>
Specify the ordering used by your software in a list, for each angular momentum.
Here is a simple example for Molden ordering.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">conv</span> = [ [ <span style="color: #8b2252;">'s'</span> ],
         [<span style="color: #8b2252;">'x'</span>, <span style="color: #8b2252;">'y'</span>, <span style="color: #8b2252;">'z'</span>],
         [<span style="color: #8b2252;">'xx'</span>, <span style="color: #8b2252;">'yy'</span>, <span style="color: #8b2252;">'zz'</span>, <span style="color: #8b2252;">'xy'</span>, <span style="color: #8b2252;">'xz'</span>, <span style="color: #8b2252;">'yz'</span>],
         [<span style="color: #8b2252;">'xxx'</span>, <span style="color: #8b2252;">'yyy'</span>, <span style="color: #8b2252;">'zzz'</span>, <span style="color: #8b2252;">'xyy'</span>, <span style="color: #8b2252;">'xxy'</span>, <span style="color: #8b2252;">'xxz'</span>, <span style="color: #8b2252;">'xzz'</span>, <span style="color: #8b2252;">'yzz'</span>, <span style="color: #8b2252;">'yyz'</span>, <span style="color: #8b2252;">'xyz'</span>],
         [<span style="color: #8b2252;">'xxxx'</span>, <span style="color: #8b2252;">'yyyy'</span>, <span style="color: #8b2252;">'zzzz'</span>, <span style="color: #8b2252;">'xxxy'</span>, <span style="color: #8b2252;">'xxxz'</span>, <span style="color: #8b2252;">'xyyy'</span>, <span style="color: #8b2252;">'yyyz'</span>, <span style="color: #8b2252;">'xzzz'</span>, <span style="color: #8b2252;">'yzzz'</span>, <span style="color: #8b2252;">'xxyy'</span>, <span style="color: #8b2252;">'xxzz'</span>, <span style="color: #8b2252;">'yyzz'</span>, <span style="color: #8b2252;">'xxyz'</span>, <span style="color: #8b2252;">'xyyz'</span>, <span style="color: #8b2252;">'xyzz'</span>] ]
</pre>
</div>

<p>
<code>conv[l]</code> returns the ordering for angular momentum <code>l</code>.
</p></li>

<li><p>
Iterate over the shells, and append the corresponding predefined lists
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">ao</span> = []
<span style="color: #a020f0;">for</span> l <span style="color: #a020f0;">in</span> shell_ang_mom:
       ao.append(conv[l])
</pre>
</div></li>

<li><p>
For each shell, assign a numerical index to each AO, then reorder them lexicographically
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">ao_ordering</span> = []
<span style="color: #a0522d;">j</span> = 0
<span style="color: #a020f0;">for</span> k,l <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">enumerate</span>(ao):
      <span style="color: #a0522d;">accu</span> = [ x, i+j, <span style="color: #a020f0;">for</span> i,x <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">enumerate</span>(l) ]
      accu.sort()
      <span style="color: #a0522d;">ao_ordering</span> += accu
      <span style="color: #a0522d;">j</span> += <span style="color: #483d8b;">len</span>(l)
<span style="color: #a0522d;">ao_ordering</span> = [ i <span style="color: #a020f0;">for</span> (_,i) <span style="color: #a020f0;">in</span> ao_ordering ]
</pre>
</div></li>
</ol>
</div>
</div>
