examples.html

<div id="outline-container-orgf6bf9f8" class="outline-3">
<h3 id="orgf6bf9f8"><span class="section-number-3">4.2.</span> Spherical AOs</h3>
<div class="outline-text-3" id="text-4-2">
<p>
For spherical AOs, you can adopt a similar approach as for Cartesian AOs,
but you will need to define a function that generates a string to
ensure lexicographic sorting functions correctly.
</p>

<ol class="org-ol">
<li><p>
Specify the ordering used by your software in a list, for each angular momentum.
Here is a simple example for Molden ordering.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">conv</span> = [ [<span style="color: #8b2252;">'s'</span>],
         [<span style="color: #8b2252;">'p+1'</span>, <span style="color: #8b2252;">'p-1'</span>, <span style="color: #8b2252;">'p+0'</span>],
         [<span style="color: #8b2252;">'d+0'</span>, <span style="color: #8b2252;">'d+1'</span>, <span style="color: #8b2252;">'d-1'</span>, <span style="color: #8b2252;">'d+2'</span>, <span style="color: #8b2252;">'d-2'</span>],
         [<span style="color: #8b2252;">'f+0'</span>, <span style="color: #8b2252;">'f+1'</span>, <span style="color: #8b2252;">'f-1'</span>, <span style="color: #8b2252;">'f+2'</span>, <span style="color: #8b2252;">'f-2'</span>, <span style="color: #8b2252;">'f+3'</span>, <span style="color: #8b2252;">'f-3'</span>],
         [<span style="color: #8b2252;">'g+0'</span>, <span style="color: #8b2252;">'g+1'</span>, <span style="color: #8b2252;">'g-1'</span>, <span style="color: #8b2252;">'g+2'</span>, <span style="color: #8b2252;">'g-2'</span>, <span style="color: #8b2252;">'g+3'</span>, <span style="color: #8b2252;">'g-3'</span>, <span style="color: #8b2252;">'g+4'</span>, <span style="color: #8b2252;">'g-4'</span>] ]
</pre>
</div></li>

<li><p>
Iterate over the shells, and append the corresponding predefined lists
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">ao</span> = []
<span style="color: #a020f0;">for</span> l <span style="color: #a020f0;">in</span> shell_ang_mom:
       ao.append(conv[l])
</pre>
</div></li>

<li><p>
Create a sorting function
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">f_sort</span>(x):
    <span style="color: #a0522d;">m</span> = <span style="color: #483d8b;">int</span>(x[1:])
    <span style="color: #a020f0;">if</span> m&gt;=0:
        <span style="color: #a020f0;">return</span> 2*m
    <span style="color: #a020f0;">else</span>:
        <span style="color: #a020f0;">return</span> -2*m+1
</pre>
</div></li>
</ol>

<ol class="org-ol">
<li><p>
For each shell, assign a numerical index to each AO, then reorder them lexicographically
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">ao_ordering</span> = []
<span style="color: #a0522d;">j</span> = 0
<span style="color: #a020f0;">for</span> k,l <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">enumerate</span>(ao):
      <span style="color: #a0522d;">accu</span> = [ f_sort(x), i+j, <span style="color: #a020f0;">for</span> i,x <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">enumerate</span>(l) ]
      accu.sort()
      <span style="color: #a0522d;">ao_ordering</span> += accu
      <span style="color: #a0522d;">j</span> += <span style="color: #483d8b;">len</span>(l)

<span style="color: #a0522d;">ao_ordering</span> = [ i <span style="color: #a020f0;">for</span> (_,i) <span style="color: #a020f0;">in</span> ao_ordering ]
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-org9c5c919" class="outline-3">
<h3 id="org9c5c919"><span class="section-number-3">4.3.</span> Reordering the MOs</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Apply the ordering to each MO, and concatenate them in a 1D array
to pass it to trexio:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">MoMatrix</span> = []
<span style="color: #a020f0;">for</span> mo <span style="color: #a020f0;">in</span> mo_coef:
      <span style="color: #a0522d;">vector</span> = np.zeros(ao_num)
      <span style="color: #a020f0;">for</span> i, x <span style="color: #a020f0;">in</span> mo:
         <span style="color: #a0522d;">vector</span>[i] = x
      <span style="color: #a020f0;">for</span> i <span style="color: #a020f0;">in</span> ao_ordering:
         MoMatrix.append(vector[i])

trexio.write_mo_coefficient(trexio_file, MoMatrix)

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: TREX-CoE</p>
<p class="date">Created: 2025-07-18 Fri 16:09</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
